The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RailingNotConnectedError { get; }
  Visual Basic
Public Shared ReadOnly Property RailingNotConnectedError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailingNotConnectedError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace